{
    "data": "
    Dominican University Ibadan (DUI) is a private institution located in Samonda, Ibadan, Oyo State, Nigeria. Established on November 22, 2016, by the Order of Preachers (Dominican Order of the Province of St. Joseph the Worker, Nigeria and Ghana), the university aims to provide quality education within the framework of Catholic higher education principles. The university's motto is \"\In veritate libertas,\"\ which translates to \"\In truth, liberty.\"\

    **Academic Programs**
    
    DUI offers a range of undergraduate programs across various faculties:
    
    - **Faculty of Science**:
    
      - B.Sc. Botany
      - B.Sc. Chemical Sciences
      - B.Sc. Computer Science
      - B.Sc. Mathematics
      - B.Sc. Physics
      - B.Sc. Statistics
      - B.Sc. Zoology
    
    - **Faculty of Humanities, Management & Social Sciences**:
    
      - B.Sc. Accounting
      - B.Sc. Business Administration
      - B.A. Christian Religious Studies
      - B.Sc. Economics
      - B.A. Philosophy
    
    - **Faculty of Communication and Media Studies**:
    
      - B.Sc. Mass Communication
      - B.Sc. Films & Multimedia
    
    - **Aquinas Faculty of Theology**:
    
      - B.A. Theology
      - Licentiate in Theology
      - Doctorate in Theology
    
    **Admission Requirements**
    
    *For 100 Level (UTME) Entry*:
    
    - Obtain five (5) credit passes at SSCE (or its equivalent) in relevant subjects, including English and Mathematics, at not more than two (2) sittings.
    - Score a satisfactory mark in the Unified Tertiary Matriculation Examination (UTME) in relevant subjects.
    
    *For Direct Entry into 200 Level*:
    
    - In addition to the five (5) credit passes at SSCE, candidates must:
      - Hold a General Certificate of Education with passes at 'A' level in a minimum of two subjects chosen from a list approved by the Senate from time to time; or
      - Have a credit-level pass in an Ordinary National Diploma (OND) or a Merit pass in a National Certificate in Education (NCE) from an approved institution; or
      - Possess a first degree or a Higher National Diploma (HND) from an approved university or polytechnic.
    
    All candidates are required to undergo a post-UTME screening and must meet the specific requirements of the department to which they are applying.
    
    **Specific SSCE and UTME Subject Requirements**
    
    Admission into specific programs requires certain subjects in the Senior Secondary Certificate Examination (SSCE) and the Unified Tertiary Matriculation Examination (UTME). Below is a general guideline:
    
    - **Sciences (e.g., Computer Science, Physics, Chemistry)**:
    
      - *SSCE*: Credit passes in English Language, Mathematics, Physics, Chemistry, and one other science subject.
      - *UTME*: English Language, Mathematics, Physics, and Chemistry.
    
    - **Social Sciences (e.g., Economics, Accounting, Business Administration)**:
    
      - *SSCE*: Credit passes in English Language, Mathematics, Economics, and two other relevant subjects.
      - *UTME*: English Language, Mathematics, Economics, and one other relevant subject.
    
    - **Humanities (e.g., Philosophy, Christian Religious Studies)**:
    
      - *SSCE*: Credit passes in English Language, and four other relevant subjects.
      - *UTME*: English Language and three other relevant subjects.
    
    Prospective students should consult the university's admissions office or official publications for detailed and specific subject requirements for each program.
    
    **Application Process**
    
    Prospective students can apply online through the university's application portal. The application form fee is ₦15,000, and the post-UTME screening exercise fee is ₦2,000. Payments are to be made into the designated university bank account. Applicants are advised to prepare necessary documents, including JAMB result slips, SSCE results, passport photographs, and proof of payment for the application and screening fees.
    
    **Principal Officers**
    
    The administration of Dominican University Ibadan is led by the following principal officers:
    
    - **Vice-Chancellor**: Professor Jacinta A. Opara
    - **Acting Registrar**: Rev. Fr. Samuel Onyiba, OP
    - **Acting Bursar**: Mrs. Sybil Chikaodili Onunaku
    - **University Librarian**: Miss Hannah Okon Anwana
    
    **Overview of the Nigerian Education System**
    
    Nigeria operates a 6-3-3-4 system of education:
    
    1. **Primary Education**: 6 years of primary schooling starting at age 6.
    2. **Junior Secondary Education**: 3 years leading to the Basic Education Certificate Examination (BECE).
    3. **Senior Secondary Education**: 3 years culminating in the Senior Secondary Certificate Examination (SSCE), conducted by WAEC or NECO.
    4. **Tertiary Education**: A minimum of 4 years at universities, leading to bachelor's degrees.
    
    The Federal Ministry of Education oversees education in Nigeria, with local authorities implementing state-controlled policies regarding public education. Despite efforts to provide free and compulsory basic education, challenges remain, including regional disparities and a significant number of out-of-school children.
    
    **Contact Information**
    
    For further inquiries, prospective students and other interested parties can contact the university through the following channels:
    
    - **Phone**: 0903-000-1712
    
    Dominican University Ibadan (DUI) is committed to providing a holistic educational experience that extends beyond traditional academic programs. The university offers a variety of professional development, religious formation, entrepreneurial initiatives, and extracurricular activities to enrich student life and prepare graduates for diverse career paths.
    
    **1. Professional Development and Vocational Training**
    
    The **Centre for Professional Training and Development (CPTD)** at DUI serves as a hub for initiating, promoting, coordinating, and delivering customized, short-term professional training and development courses, programs, workshops, and seminars. These offerings are designed for individuals and groups, developed in collaboration with university departments, external organizations, industry experts, and stakeholders. The CPTD aims to enhance lifelong learning and professional skills among participants.
    
    **2. Religious and Spiritual Formation**
    
    DUI places significant emphasis on the spiritual growth of its community. The university organizes annual retreats and spiritual programs aimed at fostering spiritual nourishment and reflection among students and staff. For instance, the Dominican Society for Vocation Support has hosted retreats at venues like the Redemptorist Retreat Centre in Ibadan, providing opportunities for participants to engage in prayer, contemplation, and community building.
    
    Additionally, the **School of Religious and Pastoral Education**, an initiative of the Dominican Institute, offers diploma programs in areas such as Catholic Spirituality and Formation, Spiritual Direction, and Parish Marriage Counseling. These programs are tailored to meet the needs of priests, religious men and women, and lay faithful seeking continuous theological, pastoral, and spiritual formation.
    
    **3. Entrepreneurship and Innovation Programs**
    
    The **Centre for Creativity and Entrepreneurial Studies (CCES)** coordinates all entrepreneurial studies at DUI, emphasizing the development of creative and innovative skills essential for entrepreneurial success and personal fulfillment. The center fosters deliberate creative and innovative practices among both university staff and students, preparing them for entrepreneurial pursuits and equipping them with life skills necessary for various endeavors.
    
    **4. Extracurricular Activities: Sports and Clubs**
    
    DUI is dedicated to promoting health, wellness, and community through a diverse array of athletic and recreational opportunities. The university's **Sports and Recreation Facilities Unit** provides students with access to various sports and recreational activities, encouraging physical fitness and teamwork.
    
    Furthermore, the university supports a variety of **student organizations** that cater to cultural, social, and recreational interests. These organizations celebrate diversity, promote cultural awareness, and offer spaces for students to share their heritage and traditions. Recreational clubs focus on interests such as sports, arts, and hobbies, providing avenues for students to pursue their passions, stay active, and unwind from academic pressures.
    
    Through these comprehensive programs and initiatives, Dominican University Ibadan ensures that students receive a well-rounded education that not only focuses on academic excellence but also fosters professional competence, spiritual growth, entrepreneurial mindset, and physical well-being.
    
    
    "
}